<a href="https://colab.research.google.com/github/sendps335/Loan_Prediction_AnalyticVidhya/blob/master/Loan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [245]:
#Importing the Required Libraries
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier
from xgboost.sklearn import XGBClassifier
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score,f1_score
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import LabelEncoder,OneHotEncoder,StandardScaler
from sklearn.impute import SimpleImputer

In [246]:
#Importing the Training Set and the Sample Submission
df_train=pd.read_csv("/content/train_ctrUa4K.csv")
df_test=pd.read_csv("/content/test_lAUu6dG.csv")
df_sample=pd.read_csv('/content/sample_submission_49d68Cx.csv')
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [247]:
df_train.head(5)

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y

[5 rows x 13 columns]

In [248]:
df_train.tail(5)

      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[5 rows x 13 columns]

In [249]:
df_test.head()

    Loan_ID Gender Married  ... Loan_Amount_Term Credit_History Property_Area
0  LP001015   Male     Yes  ...            360.0            1.0         Urban
1  LP001022   Male     Yes  ...            360.0            1.0         Urban
2  LP001031   Male     Yes  ...            360.0            1.0         Urban
3  LP001035   Male     Yes  ...            360.0            NaN         Urban
4  LP001051   Male      No  ...            360.0            1.0         Urban

[5 rows x 12 columns]

Encoding Features into Categorial Values

In [250]:
Y_train=df_train.Loan_Status.values
X_train=df_train.drop(['Loan_Status','Loan_ID'],axis=1,inplace=False)
Need_Encoding=['Gender','Married','Dependents','Education','Self_Employed','Property_Area']
le=LabelEncoder()
for i in Need_Encoding:
  kk=list(X_train[i].values)
  le.fit(kk)
  kk=le.transform(list(X_train[i].values))
  #X_train[i].values=X_train[i].values._replace(kk)
  X_train[i]=kk
  kk2=le.transform(list(df_test[i].values))
  df_test[i]=kk2

In [251]:
kk=X_train['Education'].values
kk2=df_test['Education'].values
for i in range(0,len(kk)):
  if(kk[i]==0):
    kk[i]=1
  else:
    kk[i]=0
for i in range(0,len(kk2)):
  if(kk2[i]==0):
    kk2[i]=1
  else:
    kk2[i]=0

df_test['Education']=kk2
X_train['Education']=kk
X_train.tail(5)

     Gender  Married  ...  Credit_History  Property_Area
609       0        0  ...             1.0              0
610       1        1  ...             1.0              0
611       1        1  ...             1.0              2
612       1        1  ...             1.0              2
613       0        0  ...             0.0              1

[5 rows x 11 columns]

Using Imputer(Taking Care of Nan and Missing Values)

In [252]:
Loan_test_ID=df_test.Loan_ID.values
df_test.drop('Loan_ID',axis=1,inplace=True)
sip=SimpleImputer(strategy='mean')
X_train=sip.fit_transform(X_train)
X_test=sip.transform(df_test.values)

In [253]:
print(X_train.shape,Y_train.shape)

(614, 11) (614,)

Splitting Of Data

In [254]:
X_train,X_test,Y_train,Y_test=train_test_split(X_train,Y_train,test_size=0.25,random_state=42)

In [255]:
dt=DecisionTreeClassifier(max_depth=9,random_state=None)
dt.fit(X_train,Y_train)
Y_train_pred=dt.predict(X_train)
Y_test_pred=dt.predict(X_test)
print(accuracy_score(Y_train,Y_train_pred)*100,accuracy_score(Y_test,Y_test_pred)*100)

92.82608695652173 69.48051948051948

In [256]:
pp=pd.read_csv('/content/sample_submission_49d68Cx.csv')
pp.head()

    Loan_ID Loan_Status
0  LP001015           N
1  LP001022           N
2  LP001031           N
3  LP001035           N
4  LP001051           N

In [258]:
df_test.head()

   Gender  Married  Dependents  ...  Loan_Amount_Term  Credit_History  Property_Area
0       1        1           0  ...             360.0             1.0              2
1       1        1           1  ...             360.0             1.0              2
2       1        1           2  ...             360.0             1.0              2
3       1        1           2  ...             360.0             NaN              2
4       1        0           0  ...             360.0             1.0              2

[5 rows x 11 columns]

In [259]:
print(X_test[0:5])

[[1.00000000e+00 1.00000000e+00 0.00000000e+00 1.00000000e+00
  0.00000000e+00 9.08300000e+03 0.00000000e+00 2.28000000e+02
  3.60000000e+02 1.00000000e+00 1.00000000e+00]
 [1.00000000e+00 1.00000000e+00 0.00000000e+00 1.00000000e+00
  0.00000000e+00 4.31000000e+03 0.00000000e+00 1.30000000e+02
  3.60000000e+02 8.42198582e-01 1.00000000e+00]
 [1.00000000e+00 1.00000000e+00 2.00000000e+00 1.00000000e+00
  0.00000000e+00 4.16700000e+03 1.44700000e+03 1.58000000e+02
  3.60000000e+02 1.00000000e+00 0.00000000e+00]
 [0.00000000e+00 0.00000000e+00 0.00000000e+00 1.00000000e+00
  0.00000000e+00 2.90000000e+03 0.00000000e+00 7.10000000e+01
  3.60000000e+02 1.00000000e+00 0.00000000e+00]
 [1.00000000e+00 0.00000000e+00 0.00000000e+00 1.00000000e+00
  0.00000000e+00 2.71800000e+03 0.00000000e+00 7.00000000e+01
  3.60000000e+02 1.00000000e+00 1.00000000e+00]]

In [257]:
#y_pred_real